{
    "gathered by": "Arm Sukrit",
    "last update": "28 August 2020",
    "common extensions": [
        {
            "extension": ".!ut",
            "description": "Files with !ut extension can be usually found as partially downloaded files generated by uTorrent client."
        },
        {
            "extension": ".adadownload",
            "description": "Files with adadownload file extension can be exclusively encountered as unfinished download initiated by Adobe Download Assistant."
        },
        {
            "extension": ".bc",
            "description": "Files with bc extension can be mainly found as files that represent unfinished downloads in progress which were initiated in some of the BitTorrent clients, for example BitComet."
        },
        {
            "extension": ".bc!",
            "description": "Files with bc! file extensions can be commonly found as partially downloaded files saved by BitTorrent clients. These are renamed until the download is finished."
        },
        {
            "extension": ".blf",
            "description": "Files with blf file extension are commonly found as temporary files generated by latest Windows operating system to prevent registry corruption whenever a change to registry is done."
        },
        {
            "extension": ".cache",
            "description": "Files with cache extension are used to store temporary data that can be fast accessed by certain program or software."
        },
        {
            "extension": ".crdownload",
            "description": "Files with crdownload file extension are partially downloaded files that are either still being downloaded by Chrome web browser or were not completed at all. Once the download is finished, the extension of these files is restored back to the original."
        },
        {
            "extension": ".dmp",
            "description": "Files with dmp file extension can be usually found as memory dumps generated when a program crashes. Used for troubleshooting and fixing bugs by the developers."
        },
        {
            "extension": ".download",
            "description": "A download file extension is related to Apple Safari web browser for Mac OS X and Microsoft Windows. A download file stores incomplete download."
        },
        {
            "extension": ".download",
            "description": "Files with download file extension were used in some of the previous versions of Chrome web browser to store incomplete downloads."
        },
        {
            "extension": ".download",
            "description": "Files with download file extension could, especially in the past, be found as incomplete downloads originally started by Firefox web browser version 1.x to 2.x."
        },
        {
            "extension": ".part",
            "description": "Files with  part extension are almost always partially downloaded files from internet. When the download is complete, the original extension is restored. Generally, until the download is finished, no data can be recovered from .part files."
        },
        {
            "extension": ".partial",
            "description": "Files with partial extension is related to Microsoft Internet Explorer from version 9 and Microsoft Edge and used for incomplete downloads initiated through the browser."
        },
        {
            "extension": ".temp",
            "description": "Files with temp extension can be generally found as temporary files from various programs and systems."
        },
        {
            "extension": ".tmp",
            "description": "A tmp file extension is traditionally used for temporary files in Microsoft Windows. In most cases can be safely deleted."
        }
    ]
}